# Отчет:

В интернете можно найти любую информацию о том, как именно пользоваться теми или иными возмоностями программы, например таблицами или картинками.
На habr,Stack Overflow,wiki, в документации Overleaf максимально подробно разобраны темы вместе с примерами кодов.
По сути, чтобы понять какую-то функцию, когда совсем не понимаешь код, надо посмотреть на несколько примеров: просто скопировать код , 
вставить в свой файл, скомпилировать и понять чем примеры отличаются уже в готовом варианте, а потом уже смотреть на сам код. 
Такая техника помогла мне в работе с цветом в таблицах, а также с шаблонами таблиц(где какие черточки писать между строками,
разобраться с цветом текста или заливкой квадрата) Посмотрев на несколько примеров, можно из каждого вынести свои плюсы и совместить
разные вещи в своей таблице. Написание формул изначально кажется очень сложным, но написав одну, вторую, становится уже легче и быстрее, 
все обычные вещи уже описаны, например на wikipedia есть соотношение кодов и того, что получишь на выходе программы - как делать производные, 
ставить круглые или любые другие скобки, значки интеграла и т.д. (Википедия:Примеры оформления формул). 
